balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128GP706A.PIC
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="DSADR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DSADR" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DSADR" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DSADR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="26"/>
        <edc:SFRDef edc:access="--nnnnnnrrr-n--n" edc:cname="C1CTRL1" edc:desc="" edc:impl="0x3fe9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000010010000000" edc:name="C1CTRL1" edc:nzwidth="0x10" edc:por="0000010010000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WIN" edc:desc="" edc:mask="0x1" edc:name="WIN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CANCAP" edc:desc="" edc:mask="0x1" edc:name="CANCAP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="CANCKS" edc:desc="" edc:mask="0x1" edc:name="CANCKS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSIDL" edc:desc="" edc:mask="0x1" edc:name="CSIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------rrrrr" edc:cname="C1CTRL2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1CTRL2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DNCNT0" edc:desc="" edc:mask="0x1" edc:name="DNCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DNCNT1" edc:desc="" edc:mask="0x1" edc:name="DNCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DNCNT2" edc:desc="" edc:mask="0x1" edc:name="DNCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DNCNT3" edc:desc="" edc:mask="0x1" edc:name="DNCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DNCNT4" edc:desc="" edc:mask="0x1" edc:name="DNCNT4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---rrrrr-rrrrrrr" edc:cname="C1VEC" edc:desc="" edc:impl="0x1f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000001000000" edc:name="C1VEC" edc:nzwidth="0x10" edc:por="0000000001000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ICODE" edc:desc="" edc:mask="0x7f" edc:name="ICODE" edc:nzwidth="0x7"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT" edc:desc="" edc:mask="0x1f" edc:name="FILHIT" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE3" edc:desc="" edc:mask="0x1" edc:name="ICODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE4" edc:desc="" edc:mask="0x1" edc:name="ICODE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE5" edc:desc="" edc:mask="0x1" edc:name="ICODE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE6" edc:desc="" edc:mask="0x1" edc:name="ICODE6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn--------nnnnn" edc:cname="C1FCTRL" edc:desc="" edc:impl="0xe01f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1FCTRL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSA" edc:desc="" edc:mask="0x1f" edc:name="FSA" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="DMABS" edc:desc="" edc:mask="0x7" edc:name="DMABS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FSA0" edc:desc="" edc:mask="0x1" edc:name="FSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSA1" edc:desc="" edc:mask="0x1" edc:name="FSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSA2" edc:desc="" edc:mask="0x1" edc:name="FSA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSA3" edc:desc="" edc:mask="0x1" edc:name="FSA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSA4" edc:desc="" edc:mask="0x1" edc:name="FSA4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="DMABS0" edc:desc="" edc:mask="0x1" edc:name="DMABS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMABS1" edc:desc="" edc:mask="0x1" edc:name="DMABS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMABS2" edc:desc="" edc:mask="0x1" edc:name="DMABS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--rrrrrr--rrrrrr" edc:cname="C1FIFO" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1FIFO" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FNRB" edc:desc="" edc:mask="0x3f" edc:name="FNRB" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FBP" edc:desc="" edc:mask="0x3f" edc:name="FBP" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FNRB0" edc:desc="" edc:mask="0x1" edc:name="FNRB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FNRB1" edc:desc="" edc:mask="0x1" edc:name="FNRB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FNRB2" edc:desc="" edc:mask="0x1" edc:name="FNRB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FNRB3" edc:desc="" edc:mask="0x1" edc:name="FNRB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FNRB4" edc:desc="" edc:mask="0x1" edc:name="FNRB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FNRB5" edc:desc="" edc:mask="0x1" edc:name="FNRB5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FBP0" edc:desc="" edc:mask="0x1" edc:name="FBP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FBP1" edc:desc="" edc:mask="0x1" edc:name="FBP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FBP2" edc:desc="" edc:mask="0x1" edc:name="FBP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FBP3" edc:desc="" edc:mask="0x1" edc:name="FBP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FBP4" edc:desc="" edc:mask="0x1" edc:name="FBP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FBP5" edc:desc="" edc:mask="0x1" edc:name="FBP5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
